src/Documents/Scan_ПечатныйПрайсЛист/Scan_ПечатныйПрайсЛист.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Scan_ПечатныйПрайсЛист</name>
  <basedOn>Document.Scan_Калькуляция</basedOn>
  <posting>Deny</posting>
  <attributes>
    <name>ИдентификаторПрайсЛиста</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>9</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПрайсЛиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаВступленияВСилу</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пояснение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Опубликован</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокОкругления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.Scan_Калькуляция</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РазделыПрайсЛиста</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пояснение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекущийРаздел</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ШкалаЦен</name>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоОт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДо</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Скидка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторШкалы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтандартныеСпецификации</name>
    <attributes>
      <name>СтандартнаяСпецификация</name>
      <type>
        <types>DocumentRef.Scan_СпецификацияСтандартнойМодели</types>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДляДилера</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДляДилераОкр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДляКлиента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДляКлиентаОкр</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСпецификации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦеныДляКлиента</name>
    <attributes>
      <name>ИдентификаторРаздела</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторШкалы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСпецификации</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦенаДляКлиента</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Scan_ПечатныйПрайсЛист/Forms/ФормаНастроекПечати/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДанныеДляПечати.ЗагрузитьЗначения(Параметры.ДанныеДляПечати);
	
	ЗаполнитьРазделыДляПечати();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьРазделыДляПечати()
	
	Если ДанныеДляПечати.Количество() > 0 Тогда
		ПечатныйПрайсЛист = ДанныеДляПечати[0].Значение;
	Иначе
		ПечатныйПрайсЛист = Неопределено;
		//!!
		// Выдать сообщение
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПечатныйПрайсЛист", ПечатныйПрайсЛист);
	Запрос.Текст = "ВЫБРАТЬ
	|	Scan_ПечатныйПрайсЛистРазделыПрайсЛиста.Наименование КАК Раздел
	|ИЗ
	|	Документ.Scan_ПечатныйПрайсЛист.РазделыПрайсЛиста КАК Scan_ПечатныйПрайсЛистРазделыПрайсЛиста
	|ГДЕ
	|	Scan_ПечатныйПрайсЛистРазделыПрайсЛиста.Ссылка = &ПечатныйПрайсЛист";
	
	РезультатЗапроса = Запрос.Выполнить();
	РазделыДляПечати.ЗагрузитьЗначения(РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Раздел"));
	
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Документ.Scan_ПечатныйПрайсЛист",
                            "ПФ_MXL_ПечатныйПрайсЛист",
                            ПолучитьОбъектыДляПечати(),
                            ЭтотОбъект,
                            ПолучитьПараметрыПечати());
	Закрыть();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьОбъектыДляПечати()
	
	Массив = ДанныеДляПечати.ВыгрузитьЗначения();
	Возврат Массив;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметрыПечати()
	
	ПараметрыПечати = Новый Структура;
	
	Если ДанныеДляПечати.Количество() > 0 Тогда
		ПечатныйПрайсЛист = ДанныеДляПечати[0].Значение;
		ПараметрыПечати.Вставить("ЗаголовокФормы", ПечатныйПрайсЛист.НаименованиеПрайсЛиста);
		ПараметрыПечати.Вставить("ИмяФайлаПечатнойФормы", ПечатныйПрайсЛист.НаименованиеПрайсЛиста);
	Иначе
		ПараметрыПечати.Вставить("ЗаголовокФормы", "Печатный прайс-лист");
	КонецЕсли;
	
	ПараметрыПечати.Вставить("РазделыДляПечати", РазделыДляПечати);
	
	Возврат ПараметрыПечати;
	
КонецФункции

&НаКлиенте
Процедура УстановитьПометки(Команда)
	
	РазделыДляПечати.ЗаполнитьПометки(Истина);
	
КонецПроцедуры 

&НаКлиенте
Процедура СнятьПометки(Команда)
	
	РазделыДляПечати.ЗаполнитьПометки(Ложь);
	
КонецПроцедуры
